import { testimonial } from "./dataStructure";

export const testimonials:Record<string, testimonial> = {
  '1': {
    name: '임세윤',
    part: '데이터정보플랫폼팀',
    img: '/images/testimonials/sw_profile.png',
    text: `현지님은 성실합니다. 자신이 정한 장기 목표를 미루거나 포기하지 않고 성실하게 달성해 나갑니다. 
    
    다음으로, 실천력이 강합니다. 본인이 흥미를 느끼는 분야가 있다면, 단순한 호기심에 머무르지 않고 배우고 익혀 결과물을 만들어 냅니다. 
    
    마지막으로, 기록을 잘 합니다. 사소한 내용부터 중요한 논의 사항 까지 항상 꼼꼼하게 정리하고 기록합니다. 이러한 현지님의 강점은 개발자로 성장해 나아가기에 큰 도움이 될 것이라 생각합니다.`,
    company: '/images/testimonials/kakao_logo.png',
  },
  '2': {
    name: '유원상',
    part: '검색엔진팀',
    img: '/images/testimonials/ws_profile.png',
    text: `제가 봐온 현지님의 인상적인 모습은 항상 더 나은방법이 없을까를 고민하고, 자신이 만든 결과물에 아쉬워하는 모습들이였습니다. 그런 고민을 한 이후에는 적극적인 행동과 실천으로 이를 보완하는 모습을 보아왔습니다. 실수가 있을때 이를 반복하지않기위해 메모하고 정리하는 습관을 가지고있습니다.
    
    저는 현지님이 주변사람뿐만 아니라 자기자신으로부터도 깨우치고 배우며 성장할거라는 확신이 있습니다. 자신이 아는 것을 있는 그대로 이야기할줄 알며, 주변 사람들의 조언을 듣고 받아들이는 방법을 알고있습니다. 이것이 현지님의 가장 큰 강점이라고 생각합니다. 
    
    좋은 개발자들과 함께한다면 회사에 큰 기여를 할 친구라고 생각되어 이렇게 추천사를 작성합니다.`,
    company: '/images/testimonials/naver_logo.png',
    position: 'R',
  },
  '3': {
    name: '서상덕 이사',
    part: '',
    img: '/images/testimonials/sd_profile.png',
    text: `유현지 씨를 소프트웨어 엔지니어로 추천합니다. 저는 그와 2년간 같이 일한 경험이 있습니다.
    
    TL;DR
    그는 일을 주도적으로 진행하며 주어진 시간 내에 수행하는 성실함을 가지고 있습니다. 새로운 문제가 발생하거나 새로운 기술 습득에 대해서도 두려움이 없이 적극적으로 해결하고 습득합니다. 결과물을 정리하고 전달하는데 좋은 능력을 갖추고 있습니다. 그는 재능 있고 성실한 소프트웨어 엔지니어이기에, 만약 그에게 기회가 주어진다면 그가 가지고 있는 역량으로 충분히 잘 해낼 거라 믿어 의심치 않기에 강력히 추천합니다.
    
    그는 주도적이며 성실합니다. 같이 일하는 동안 일을 주도적으로 진행했으며, 약속된 마감일에는 주어진 작업을 완료하는 성실함을 가지고 있습니다. 업무에 대한 시간 관리 능력이 좋아서 신뢰할 수 있는 엔지니어입니다.
    
    그는 문제 해결 능력을 갖추고 있습니다. 경험하지 못한 새로운 문제가 발생해도 적극적으로 찾아보고 탐구하여 문제를 해결하는 능력을 갖추고 있습니다. 익숙하지 않은 Infra와 BackEnd의 문제도 적극적으로 대처하여 해결하곤 하였습니다.
    
    그는 새로운 것들에 대해 열린 태도를 가지고 있습니다. 같이 일하는 동안 새로 기술이나 프레임워크가 변경되어도 두려움 없이 적응하여 성공적으로 수행하였습니다. 새로운 것에 대한 두려움보다는 탐구력으로 단시간에 습득하여 프로젝트를 성공으로 이끌었습니다. 그 기술이 FrontEnd 이거나 BackEnd 를 구분하지 않고 잘 습득하여 프로젝트를 성공적으로 수행하였습니다. 
    
    그는 정리를 잘합니다. 문서나 생각을 정리하는 능력이 뛰어납니다. 팀에서 논의된 내용을 정리하여 말이나 문서로 작성하여 전달하는 능력이 좋으며 작은 부분도 놓치지 않는 세밀한 능력을 갖추고 있습니다. 또한 표현력도 좋아서 FrontEnd 엔지니어로도 훌륭한 재목이라 생각합니다.
    
    아직은 경험이 적어서 실수도 있었지만, 그는 재능 있고 성실한 소프트웨어 엔지니어이기에, 우리는 그와 같이 일하고 싶었습니다. 그러나 그가 하고 싶은 일이 우리와 조금은 다르기에 기꺼이 이별하였습니다. 만약 그에게 기회가 주어진다면 그가 가지고 있는 역량으로 충분히 잘 해낼 거라 믿어 의심치 않기에 강력히 추천합니다. `,
    company: '/images/career/kirbs_logo.png',
  },
  '4': {
    name: '김하진',
    part: 'FE Chapter',
    img: '/images/testimonials/hj_profile.png',
    text: `현지님은 책임감있고, 성실합니다.
    저와 함께 스터디를 진행했는데, 현지님은 스터디 목표를 정확하게 설정하고, 계획을 꼼꼼하게 세워주었습니다. 그리고 함께 완주할 수 있도록 책임감 있게 리더로서 이끌어주었습니다.
    
    뿐만아니라 궁금한 것은 깊이 파고들고, 알게된 지식을 적극적으로 공유합니다. 스터디 중 모르는 내용이 나와서 토론하다 잘 모르는 상태로 마친 적이 있는데, 다음날 현지님이 제대로 된 내용을 찾아서 공유해주었습니다. 현지님 덕분에 긍정적인 자극을 많이 받게 됩니다.
    
    이런 모습을 가진 현지님은 좋은 동료, 좋은 개발자가 될 것이라 생각합니다.`,
    company: '/images/career/yogiyo_logo.png',
    position: 'R',
  },
  '5': {
    name: '강푸름',
    part: 'FE Chapter',
    img: '/images/testimonials/pr_profile.png',
    text: `현지님을 동료 엔지니어로써 추천합니다.
    자신이 맡은 일뿐만 아니라 그 외적인 일에도 항상 관심과 추진력을 가지고 수행해냅니다.
    
    현지님은 문서 정리와 기록을 잘합니다.
    기존에 작성되어 있던 팀 내 위키 문서를 다른 사람들이 쉽게 이해할 수 있도록 직관적으로 구조를 개선하였고 그 결과 누구나 쉽게 관리할 수 있게 되었습니다. 기존 팀원들뿐 아니라 신규 입사자들이 업무를 파악하는 데에 많은 시간이 단축될 수 있었습니다.
    
    또한 배려심이 깊고 다른 동료들과의 관계가 좋습니다.
    Frontend 엔지니어는 특히 다른 직군들 과의 커뮤니케이션이 중요한데 의사소통 능력이 뛰어나 큰 문제 없이 협업을 잘 해냅니다. 
    
    추진력뿐만 아니라 배려심 깊은 성격은 주변 사람들에게 긍정적인 업무 환경을 만들어 주어 시간이 지나면 팀원들을 이끄는 좋은 리더가 될 수 있을 거라 기대합니다.
    
    결론적으로 뛰어난 협업 능력, 리더십 자질, 배려심을 갖춘 엔지니어로써 어느 조직에서도 필요한 동료가 될 것입니다.`,
    company: '/images/career/yogiyo_logo.png'
  },
  '6': {
    name: '최현주',
    part: '탐지프로덕트개발팀',
    img: '/images/testimonials/hju_profile.png',
    text: `현지님이랑 같이 일하면서 피드백을 빠르게 반영하는 점이 인상적이었습니다. 코드 리뷰 과정 중에 피드백 차원으로 남긴 코멘트는 모두 반영했습니다. 
    
    커뮤니케이션에도 강점이 있어 같은 직군 뿐만 아니라 기획, 백엔드 등 다양한 다른 직군과 협업하여 프로젝트를 완수하는 등 다양한 성과를 만들어 냈습니다.

    기술에 대한 호기심이 많아 개인을 넘어 조직 차원에서도 개발 스터디를 이끈 경험도 있습니다. 이를 통해 조직 차원에서도 긍정적인 분위기를 만들어 냈습니다.
    `,
    company: '/images/career/nexon_logo.png',
    position: 'R',
  }
};