import { testimonial } from "./dataStructure";

export const testimonials:Record<string, testimonial> = {
  '1': {
    name: '서상덕 이사',
    part: '',
    img: '/images/testimonials/sd_profile.png',
    text: `유현지 씨를 소프트웨어 엔지니어로 추천합니다. 저는 그와 2년간 같이 일한 경험이 있습니다.
    
    TL;DR
    그는 일을 주도적으로 진행하며 주어진 시간 내에 수행하는 성실함을 가지고 있습니다. 새로운 문제가 발생하거나 새로운 기술 습득에 대해서도 두려움이 없이 적극적으로 해결하고 습득합니다. 결과물을 정리하고 전달하는데 좋은 능력을 갖추고 있습니다. 그는 재능 있고 성실한 소프트웨어 엔지니어이기에, 만약 그에게 기회가 주어진다면 그가 가지고 있는 역량으로 충분히 잘 해낼 거라 믿어 의심치 않기에 강력히 추천합니다.
    
    그는 주도적이며 성실합니다. 같이 일하는 동안 일을 주도적으로 진행했으며, 약속된 마감일에는 주어진 작업을 완료하는 성실함을 가지고 있습니다. 업무에 대한 시간 관리 능력이 좋아서 신뢰할 수 있는 엔지니어입니다.
    
    그는 문제 해결 능력을 갖추고 있습니다. 경험하지 못한 새로운 문제가 발생해도 적극적으로 찾아보고 탐구하여 문제를 해결하는 능력을 갖추고 있습니다. 익숙하지 않은 Infra와 BackEnd의 문제도 적극적으로 대처하여 해결하곤 하였습니다.
    
    그는 새로운 것들에 대해 열린 태도를 가지고 있습니다. 같이 일하는 동안 새로 기술이나 프레임워크가 변경되어도 두려움 없이 적응하여 성공적으로 수행하였습니다. 새로운 것에 대한 두려움보다는 탐구력으로 단시간에 습득하여 프로젝트를 성공으로 이끌었습니다. 그 기술이 FrontEnd 이거나 BackEnd 를 구분하지 않고 잘 습득하여 프로젝트를 성공적으로 수행하였습니다. 
    
    그는 정리를 잘합니다. 문서나 생각을 정리하는 능력이 뛰어납니다. 팀에서 논의된 내용을 정리하여 말이나 문서로 작성하여 전달하는 능력이 좋으며 작은 부분도 놓치지 않는 세밀한 능력을 갖추고 있습니다. 또한 표현력도 좋아서 FrontEnd 엔지니어로도 훌륭한 재목이라 생각합니다.
    
    아직은 경험이 적어서 실수도 있었지만, 그는 재능 있고 성실한 소프트웨어 엔지니어이기에, 우리는 그와 같이 일하고 싶었습니다. 그러나 그가 하고 싶은 일이 우리와 조금은 다르기에 기꺼이 이별하였습니다. 만약 그에게 기회가 주어진다면 그가 가지고 있는 역량으로 충분히 잘 해낼 거라 믿어 의심치 않기에 강력히 추천합니다. `,
    company: '/images/kirbs_logo.png'
  },
  '2': {
    name: '유원상',
    part: '검색엔진팀',
    img: '/images/testimonials/ws_profile.png',
    text: `제가 봐온 현지님의 인상적인 모습은 항상 더 나은방법이 없을까를 고민하고, 자신이 만든 결과물에 아쉬워하는 모습들이였습니다. 그런 고민을 한 이후에는 적극적인 행동과 실천으로 이를 보완하는 모습을 보아왔습니다. 실수가 있을때 이를 반복하지않기위해 메모하고 정리하는 습관을 가지고있습니다.
    
    저는 현지님이 주변사람뿐만 아니라 자기자신으로부터도 깨우치고 배우며 성장할거라는 확신이 있습니다. 자신이 아는 것을 있는 그대로 이야기할줄 알며, 주변 사람들의 조언을 듣고 받아들이는 방법을 알고있습니다. 이것이 현지님의 가장 큰 강점이라고 생각합니다. 
    
    좋은 개발자들과 함께한다면 회사에 큰 기여를 할 친구라고 생각되어 이렇게 추천사를 작성합니다.`,
    company: '/images/testimonials/naver_logo.png',
    position: 'R',
  },
  '3': {
    name: '임세윤',
    part: '데이터정보플랫폼팀',
    img: '/images/testimonials/sw_profile.png',
    text: `현지님은 성실합니다. 자신이 정한 장기 목표를 미루거나 포기하지 않고 성실하게 달성해 나갑니다. 
    
    다음으로, 실천력이 강합니다. 본인이 흥미를 느끼는 분야가 있다면, 단순한 호기심에 머무르지 않고 배우고 익혀 결과물을 만들어 냅니다. 
    
    마지막으로, 기록을 잘 합니다. 사소한 내용부터 중요한 논의 사항 까지 항상 꼼꼼하게 정리하고 기록합니다. 이러한 현지님의 강점은 개발자로 성장해 나아가기에 큰 도움이 될 것이라 생각합니다.`,
    company: '/images/testimonials/kakao_logo.png',
  }
};